{
    "assignments": [
        {
            "name": "Five Homework Photos",
            "description": "Over our semester, we were required to take five photos every two weeks to teach us about the basics of photography. Here are some of the photos I took.",
            "images": ["img/homework1_2.jpg", "img/homework1_1.jpg", "img/homework1_3.jpg", "img/homework1_4.jpg", "img/homework1_5.jpg"]
        },
        {
            "name": "History 301 Asignment",
            "description": "This was a first project to get used to the basics of photshop. We learned about how we can and can't use generative AI during this lesson. We also learned about the basics of brushes and the tools we will use every day in our class.",
            "images": ["img/lesson3.jpg"]
        },
        {
            "name": "Pineapple Hawaii Postcard",
            "description": "This asignment taught us about using layers within photoshop, as well as a lot about effects. We learned how to put borders around things",
            "images": ["img/lesson4.jpg"]
        },
        {
            "name": "The Family On the Bridge",
            "description": "I learned how to correct photos with the healing tools. I was able to remove spots and scratches, denoise with filters, and sharpen a blury image. We also learned how to recolor images.",
            "images": ["img/lesson5.jpg"]
        },
        {
            "name": "Retouching Practice",
            "description": "I practiced all my retouching tools to prepair for my large retouching asingment. I reviewed using AI to retouch, recoloring badly faded images, and also reviewed all my basic retouching tools. I also got to do a retouching on my own",
            "images": ["img/lesson61.jpg", "img/lesson62.jpg", "img/lesson63.jpg", "img/lesson64.jpg", "img/lesson65.jpg", "img/lesson66.jpg"]
        },
        {
            "name": "Personal Retouching Project",
            "description": "This was a personal project where I worked alone to retouch and repair and image. The image I chose was brutal to work on and I'm not 100% happy with the final result, however it still turned out well and tehre is a lot of improvement from the origonal. I had to recolor it and then remove all sorts of scratches, missiing sections, dirt, and stains from the image.",
            "images": ["img/retouch1b.jpg", "img/retouch1a.jpg"]
        }
    ]
}