{
    "assignments": [
        {
            "name": "3. Techniques for Selecting Artwork",
            "description": "We learned how the selection tools work in illustrator, especially objects and anchor points. We also learned how to change the colors of things and adjust the positions of things",
            "images": ["3_1", "3_2"]
        },        
        {
            "name": "4. Make a Logo with Shapes",
            "description": "We learned how illustrator's shape tools. We learned how to make basic2 shapes, make stars, round rectangles, and more.",
            "images": ["4"]
        },
        {
            "name": "5. Editing and Combining Shapes and Paths",
            "description": "We learned about the pathfinding and shape combing tools illustrator offers. We also learned about making our own curves.",
            "images": ["5"]
        },
        {
            "name": "6. Character Creation (cat)",
            "description": "We continued to learn more about illustrators tools for making designs. We learned about illustrators layer system and how to pick colors.",
            "images": ["6"]
        },
        {
            "name": "8. Graphic Creation Choice Project 1",
            "description": "We were given free choice of what we would need to do for the project, focused on making stickers. I made two stickers with a robotics theme. They were heavy on layers and the pathfinder.",
            "images": ["8_1", "8_2"]
        },
        {
            "name": "9. Using Basic Drawing Tools",
            "description": "We learned the basics of the pen tool to follow a tutorial logo. It involved using curves and lines.",
            "images": ["9"]
        },
        {
            "name": "10. Drawing with the Pen Tool",
            "description": "We learned more advanced tequniques for drawing with the pen tool. This involved more advanced used of the control points ofr curves and changing the types of some points.",
            "images": ["10_1", "10_2","10_3","10_4","10_5","10_6","10_7"]
        },        
        {
            "name": "10B. Pen Tool Application",
            "description": "We used the pen tool to draw a meme image. I chose the sad cat. I did'nt quite finish it, but it gave me lots of practice.",
            "images": ["10b"]
        },        
        {
            "name": "11. Pen Tool Self Portrait",
            "description": "I used the pen tool toc omplete a portrate of myself. This gave me a lot of practice in getting the curves I wanted out of the pen tool. I feel pretty confident with it after this. ",
            "images": ["11"]
        },
        {
            "name": "12. Using Brushes to Create an Ad",
            "description": "We used brushes to create a basic ad. This was  tutorial, but I tried different patern brushes and colors. It really gave me an insight to the brushes in illustrator.",
            "images": ["12"]
        },
        {
            "name": "13A. Brush Exploration",
            "description": "I tried different brushes to see what they looked like. the denim seam was cool, becuase I didnt think that brushes would work like that.",
            "images": ["13a"]
        },        {
            "name": "13. Choice (brush focused) Design",
            "description": "I used brushes to work on a covere for a BBNO$ song called \"Meant to be\". I think that it turned out very well, although I did not finish it.",
            "images": ["13"]
        },
        {
            "name": "14. Adding Type to a Poster",
            "description": "This asignment tought us the basics of type in illustrator. We learned about point, block, and threaded type. It still seems a it awkward to work with, though.",
            "images": ["14_1", "14_2"]
        },        
        {
            "name": "15. Fine Arts Festival Poster",
            "description": "We were given an opprotunity to design a poster for the PBL Fine Arts Festival. I decided to make seperate sections for the different thinks that appear at the show: Art, Music, and Comedy. I think that this design was pretty good, capturing the arts that were shown off at te festival",
            "images": ["15"]
        },        
        {
            "name": "16. Gradients, Blends, and Patterns",
            "description": "We foloowed a tutorial to learn how to work with different gradients in Illustrator. THe gradient tool works really well and I understood it a lot.",
            "images": ["16"]
        },
        {
            "name": "17. Pictionary Recreation",
            "description": "We were given the chance to use ProCreate to redraw a sketch made in a short game. I made a 3 layer design with a night sky, grassy foliage, and the person in the front.",
            "images": ["17"]
        },        
        {
            "name": "20. Rebranding Your Business",
            "description": "I chose to rebrand the robotics company GoBILDA. I chose this company becuase its very realvent to me because I like robotics. I chose to focus on making the logo out of parts that they sell, as well as making a product advertisement and the new label for that product.",
            "images": ["20_1", "20_2", "20_3"]
        }
    ]
}